import random
# Победитель выбирается согласно следующим правилам:
# 1)Если один игрок выбирает камень, а другой игрок выбирает ножницы, то побеждает
# камень (камень разбивает ножницы);
# 2)Если один игрок выбирает ножницы, а другой игрок выбирает бумагу, то побеждают
# ножницы (ножницы режут бумагу);
# 3)Если один игрок выбирает бумагу, а другой игрок выбирает камень, то побеждает
# бумага (бумага заворачивает камень);
# 4)Если оба игрока делают одинаковый выбор, то для определения победителя нужно
# сыграть повторный раунд.

exit = 'да'
while exit == 'да' or exit == 'Да':
    list = ['камень', 'ножницы', 'бумага']
    computer = random.choice(list)
    player = int(input('Выберете свой жест:\n1 - камень\n2 - ножницы\n3 - бумага\n'))
    print('Компьютер выбрал:', computer)
    if computer == 'ножницы' and player == 1:
        print('Поздравляем вы победили!')
    elif computer == 'камень' and player == 3:
        print('Поздравляем вы победили!')
    elif computer == 'бумага' and player == 2:
        print('Поздравляем вы победили!')
    else:
        print('Вы проиграли')
    exit = input('Хотите сыграть еще?да/нет:\n')
